#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113601655793]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113601655786]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113601655814]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113601655813]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113601655806]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113601655810]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113601655811]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113601655809]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113601655815]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113601655805]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113600510456]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113601655812]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113601655790]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113601655795]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113601655796]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113601655789]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113601655788]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113601655804]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113601655803]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113601655794]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113601655791]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113601655792]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113601655787]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113601655785]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113601655819]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113601655822]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113601655821]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113601655820]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113601655830]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113601655831]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=19726]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655795" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113601655819" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655790" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113601655821" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113601655796" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113601655822" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113601655789" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113601655820" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655792" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113601655855" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655804" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113601655833" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655788" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113601655830" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655791" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113601655829" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655787" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113601655831" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655794" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113601655851" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655803" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113601655835" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113601655785" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113601655834" -> (known after apply)
      ~ source_archive_id    = "113600510489" -> "113600510456" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655795",
        ] -> (known after apply)
        id                = "113601655819"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655790",
        ] -> (known after apply)
        id                = "113601655821"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113601655796",
        ] -> (known after apply)
        id                = "113601655822"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113601655789",
        ] -> (known after apply)
        id                = "113601655820"
        name              = "k8s-dev-router-1"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-1"
          + ip_address      = "163.43.217.232"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.20"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-2"
          + ip_address      = "163.43.217.233"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.21"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655788",
          - "113601655805",
        ] -> (known after apply)
        id                = "113601655830"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-4"
          + ip_address      = "163.43.217.235"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.23"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113601655787",
          - "113601655811",
        ] -> (known after apply)
        id                = "113601655831"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-6"
          + ip_address      = "163.43.217.237"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.25"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[6] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-7"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-7"
          + ip_address      = "163.43.217.238"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.26"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[7] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = (known after apply)
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 4
      + name              = "k8s-dev-worker-node-8"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "@nic-double-queue",
          + "dev",
          + "k8s",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.217.225"
          + hostname        = "k8s-dev-worker-node-8"
          + ip_address      = "163.43.217.239"
          + netmask         = 27
          + password        = (sensitive value)
          + ssh_key_ids     = [
              + "113601655793",
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655816"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113601655786"
          + user_ip_address = "192.168.100.27"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

Plan: 18 to add, 6 to change, 12 to destroy.

Changes to Outputs:
  + k8s_worker_node_ip_address   = [
      + (known after apply),
      + (known after apply),
      + "163.43.217.234",
      + (known after apply),
      + "163.43.217.236",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>